Revit 2027 API
LeaderEndCondition Enumeration
 An enumerated type listing leader end conditions that are supported for IndependentTags.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum LeaderEndCondition
Public Enumeration LeaderEndCondition
public enum class LeaderEndCondition
type LeaderEndCondition
Members
Member name | Value | Description
Attached | 0 |  Revit automatically keeps the leader end point attached to the tagged element.
Free | 1 |  The leader end point can be freely positioned by the user.
Remarks
 The leader end point is the point on the leader which is closest to the tagged element.
See Also
Reference
Autodesk.Revit.DB Namespace